Revit 2027 API
HorizontalCurveEndpoint.NextCurveType Property
 The HorizontalCurveType of the curve which connects the endpoint to the next displayed curve. If this endpoint's Station equals DisplayedEndStation, returns Unknown curve type.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HorizontalCurveType NextCurveType { get; }
Public ReadOnly Property NextCurveType As HorizontalCurveType
	Get
public:
property HorizontalCurveType NextCurveType {
	HorizontalCurveType get ();
}
member NextCurveType : HorizontalCurveType with get
Property Value
HorizontalCurveType
See Also
Reference
HorizontalCurveEndpoint Class
Autodesk.Revit.DB.Infrastructure Namespace